
TRIGGERS = {'капи'}

data_set = {

'' : 'empty !',
'хочу спать':'passive сон для слабакОв',
'не могу заснуть':'passive значит не судьба',
'как дела': 'passive отлично',
'што делать' : 'passive иди учись',
'скажи привет на английском' : 'passive hi...',
'развесели' : 'passive XD',
'скажи время' : 'passive время',
'скажи дату' : 'passive дата',
'запрос яндекс' : 'passive яндекс',
'запрос ютуб' : 'passive ютуб',
'воин мех' : 'passive военмех',
'включи музыку' : 'play_music приятного прослушивания',
'отключись' : 'offBot гудбай чао аривидерчи бай бай до скорой встречи',
'открой почту ' : 'browser(0) сейчас посмотрим что новенького',
'открой мудл ' : 'browser(1) иди решай тесты',
'открой moodle ' : 'browser(1) иди решай тесты',






#'':'',
}

voenmeh_sections = {
    'главная' : '',
    'карта' : '/#openMap',
    'факультеты и кафедры' : '/education/faculties-and-departments',
    'расписание' : '/trainee/timetable-stud',
    'контакты' : '/contacts',
    }
