
TRIGGERS = {'капи'}

data_set = {

'' : 'empty !',
'хочу спать':'passive сон для слабакОв',
'не могу заснуть':'passive значит не судьба',
'как дела': 'passive отлично',
'што делать' : 'passive иди учись',
'скажи привет на английском' : 'passive hi...',
'пока' : 'offBot гудбай чао аривидерчи бай бай до скорой встречи',
'развесели' : 'passive XD',
'скажи время' : 'passive время',
'скажи дату' : 'passive дата',
'запрос яндекс' : 'passive яндекс',
'запрос ютуб' : 'passive ютуб',
'отключись' : 'offBot гудбай чао аривидерчи бай бай до скорой встречи',

#'':'',
}
