
TRIGGERS = {'капи'}

data_set = {

'хочу спать':'passive сон для слабакОв',
'не могу заснуть':'passive значит не судьба',
'как дела': 'passive отлично',
'что делать' : 'passive иди учись',
'скажи как будет привет на английском' : 'passive hi...',
'отключись' : 'offBot гудбай чао аривидерчи бай бай до скорой встречи',
'пока' : 'offBot гудбай чао аривидерчи бай бай до скорой встречи',
'развесели' : 'passive XD',
'открой почту ' : 'browser(0) сейчас посмотрим что новенького',
'открой мудл ' : 'browser(1) иди решай тесты',
'открой moodle ' : 'browser(1) иди решай тесты',





#'':'',
}
