
TRIGGERS = {'капи', 'капель', 'копи'}

data_set = {

#'' : 'empty !',
'хочу спать':'passive сон для слабакОв',
'не могу заснуть':'passive значит не судьба',
'как дела': 'passive отлично',
'что делать' : 'passive иди учись',
'скажи привет на английском' : 'passive hi...',
'развесели' : 'passive XD',
'скажи время' : 'passive время',
'скажи дату' : 'passive дата',
'запрос яндекс' : 'passive яндекс',
'запрос ютуб' : 'passive ютуб',
'воин мех' : 'passive военмех',
'включи музыку' : 'play_music приятного прослушивания',
'загадай число' : 'passive игра',
'отключись' : 'offBot гудбай чао аривидерчи бай бай до скорой встречи',

#'':'',
}

voenmeh_sections = {
    'главная' : '',
    'карта' : '/#openMap',
    'факультеты и кафедры' : '/education/faculties-and-departments',
    'расписание' : '/trainee/timetable-stud',
    'контакты' : '/contacts',
    'муд ул' : '/login/index.php',
    'моду' : '/login/index.php',
    'почта' : '/mail/',
    'назад' : '!',
    }



guessing_game = {
    'один' : 1,
    'два' : 2,
    'три' : 3,
    'четыре' : 4,
    'пять' : 5,
    'назад' : -1,
    }